apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_twai.c
/****************************************************************************
 * arch/xtensa/src/esp32s2/esp32s2_twai.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/spinlock.h>

#include "xtensa.h"

#include "espressif/esp_gpio.h"
#include "esp32s2_twai.h"
#include "espressif/esp_irq.h"
#include "esp_clk.h"

#include "hardware/esp32s2_system.h"
#include "hardware/esp32s2_gpio_sigmap.h"
#include "hardware/esp32s2_twai.h"

#if defined(CONFIG_ESP32S2_TWAI)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* Default values written to various registers on initialization */

#define TWAI_INIT_TEC             0
#define TWAI_INIT_REC             0
#define TWAI_INIT_EWL             96

/* Exclude data overrun (bit[3]) and brp_div (bit[4]) */

#define TWAI_DEFAULT_INTERRUPTS   0xe7

#define TWAI_ACCEPTANCE_CODE      0x0           /* 32-bit address to match */
#define TWAI_ACCEPTANCE_MASK      0xffffffff    /* 32-bit address mask */

#ifdef CONFIG_ESP32S2_TWAI

/* A TWAI bit rate must be provided */

#  ifndef CONFIG_ESP32S2_TWAI_BITRATE
#    error "CONFIG_ESP32S2_TWAI_BITRATE is not defined"
#  endif

/* If no sample point is provided, use a sample point of 80 */

#  ifndef CONFIG_ESP32S2_TWAI_SAMPLEP
#    define CONFIG_ESP32S2_TWAI_SAMPLEP 80
#  endif
#endif

/* If no Synchronization Jump Width is provided, use a SJW of 3 */

#ifndef CONFIG_ESP32S2_TWAI_SJW
#  define CONFIG_ESP32S2_TWAI_SJW 3
#endif

/* Debug ********************************************************************/

/* Non-standard debug that may be enabled just for testing TWAI */

#ifndef CONFIG_DEBUG_CAN_INFO
#  undef CONFIG_ESP32S2_TWAI_REGDEBUG
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* CAN hardware-dependent bit-timing constant
 * Used for calculating and checking bit-timing parameters
 */

struct can_bittiming_const
{
  uint32_t tseg1_min;  /* Time segment 1 */
  uint32_t tseg1_max;
  uint32_t tseg2_min;  /* Time segment 2 */
  uint32_t tseg2_max;
  uint32_t sjw_min;    /* Synchronization jump width */
  uint32_t sjw_max;
  uint32_t brp_min;    /* Bit-rate prescaler */
  uint32_t brp_max;
  uint32_t brp_inc;
};

struct twai_dev_s
{
  /* Device configuration */

  const struct can_bittiming_const *bittiming_const;
  uint8_t port;       /* TWAI port number */
  uint8_t periph;     /* Peripheral ID */
  uint8_t irq;        /* IRQ associated with this TWAI */
  int8_t cpuint;      /* CPU interrupt assigned to this TWAI */
  uint32_t bitrate;   /* Configured bit rate */
  uint32_t samplep;   /* Configured sample point */
  uint32_t sjw;       /* Synchronization jump width */
  uint32_t base;      /* TWAI register base address */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* TWAI Register access */

#ifdef CONFIG_ESP32S2_TWAI_REGDEBUG
static void twai_printreg(uint32_t addr, uint32_t value);
#endif

static uint32_t twai_getreg(uint32_t addr);
static void twai_putreg(uint32_t addr, uint32_t value);

/* TWAI methods */

static void esp32s2twai_reset(struct can_dev_s *dev);
static int  esp32s2twai_setup(struct can_dev_s *dev);
static void esp32s2twai_shutdown(struct can_dev_s *dev);
static void esp32s2twai_rxint(struct can_dev_s *dev, bool enable);
static void esp32s2twai_txint(struct can_dev_s *dev, bool enable);
static int  esp32s2twai_ioctl(struct can_dev_s *dev, int cmd,
                              unsigned long arg);
static int  esp32s2twai_remoterequest(struct can_dev_s *dev,
                                      uint16_t id);
static int  esp32s2twai_send(struct can_dev_s *dev,
                             struct can_msg_s *msg);
static bool esp32s2twai_txready(struct can_dev_s *dev);
static bool esp32s2twai_txempty(struct can_dev_s *dev);

/* TWAI interrupts */

static int esp32s2twai_interrupt(int irq, void *context, void *arg);

/* TWAI acceptance filter */

static void esp32s2twai_set_acc_filter(uint32_t code, uint32_t mask,
                                       bool single_filter);

/* TWAI bit-timing initialization */

static int twai_baud_rate(struct twai_dev_s *priv, int rate, int clock,
                          int sjw, int sampl_pt, int flags);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct can_bittiming_const esp32s2_twai_bittiming_const =
{
  .tseg1_min        = 1,
  .tseg1_max        = 16,
  .tseg2_min        = 1,
  .tseg2_max        = 8,
  .sjw_min          = 1,
  .sjw_max          = 3,
  .brp_min          = 1,
  .brp_max          = 16384,
  .brp_inc          = 1,
};

static const struct can_ops_s g_twaiops =
{
  .co_reset         = esp32s2twai_reset,
  .co_setup         = esp32s2twai_setup,
  .co_shutdown      = esp32s2twai_shutdown,
  .co_rxint         = esp32s2twai_rxint,
  .co_txint         = esp32s2twai_txint,
  .co_ioctl         = esp32s2twai_ioctl,
  .co_remoterequest = esp32s2twai_remoterequest,
  .co_send          = esp32s2twai_send,
  .co_txready       = esp32s2twai_txready,
  .co_txempty       = esp32s2twai_txempty,
};

#ifdef CONFIG_ESP32S2_TWAI
static struct twai_dev_s g_twaipriv =
{
  .bittiming_const  = &esp32s2_twai_bittiming_const,
  .port             = 0,
  .periph           = ESP32S2_PERIPH_TWAI,
  .irq              = ESP32S2_IRQ_TWAI,
  .cpuint           = -ENOMEM,
  .bitrate          = CONFIG_ESP32S2_TWAI_BITRATE,
  .samplep          = CONFIG_ESP32S2_TWAI_SAMPLEP,
  .sjw              = CONFIG_ESP32S2_TWAI_SJW,
  .base             = DR_REG_TWAI_BASE,
};

static struct can_dev_s g_twaidev =
{
  .cd_ops           = &g_twaiops,
  .cd_priv          = &g_twaipriv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: twai_printreg
 *
 * Description:
 *   Print the value read from a register.
 *
 * Input Parameters:
 *   addr - The register address
 *   value - The register value
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S2_TWAI_REGDEBUG
static void twai_printreg(uint32_t addr, uint32_t value)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval   = 0;
  static uint32_t count    = 0;

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && value == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              caninfo("...\n");
            }

          return;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

